//=============================================================================
//
// プレイヤー処理 [block.h]
// Author : TAKASHI AKYAMA
//
//=============================================================================

#ifndef _BLOCK_H_	// ２重インクルード防止のマクロ定義
#define _BLOCK_H_

//*************************************
// プレイヤー構造体
//*************************************
typedef struct
{
	int PosX;		// 現在の位置Ｘ
	int PosY;		// 現在の位置Ｙ
	int thief;
	int blocktime;
	int ammoblock;
} BLOCK;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBlock(void);
void UninitBlock(void);
void UpdateBlock(void);
void DrawBlock(void);
void collision(void);
#endif