//=============================================================================
//
// プレイヤー処理 [block.h]
// Author : TAKASHI AKYAMA
//
//=============================================================================

#ifndef _MAP_H_	// ２重インクルード防止のマクロ定義
#define _MAP_H_


//*************************************
// プレイヤー構造体
//*************************************
typedef struct
{
	int mapcount;
	int mapchangeflag;
	int beforemapX[10];
	int beforemapY[10];
	int nextmapX[10];
	int nextmapY[10];

}MAP;

//*************************************
// マップ構造体
//*************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMap(void);
void UninitMap(void);
void UpdateMap(void);
void DrawMap(void);
void mapcollision(void);
#endif

