//=============================================================================
//
// プレイヤー処理 [block.h]
// Author : TAKASHI AKYAMA
//
//=============================================================================

#ifndef _WALL_H_	// ２重インクルード防止のマクロ定義
#define _WALL_H_

//*************************************
// プレイヤー構造体
//*************************************
typedef struct
{
	int WPosX[4];		// 現在の位置Ｘ
	int WPosY[4];		// 現在の位置Ｙ
}WALL;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitWall(void);
void UninitWall(void);
void UpdateWall(void);
void DrawWall(void);
void Wallcollision(void);
#endif

